#include <iostream>

//cin — класс istream_withassign, связанный со стандартным вводом(обычно это клавиатура);
//
//cout — класс ostream_withassign, связанный со стандартным выводом(обычно это монитор);
//
//cerr — класс ostream_withassign, связанный со стандартной ошибкой(обычно это монитор), обеспечивающий небуферизованный вывод;
//cerr не буферизуется.
//clog — класс ostream_withassign, связанный со стандартной ошибкой(обычно это монитор), обеспечивающий буферизованный вывод.

int main()
{
    // оператор вставки с объектом cout для вывода текста на монитор
    std::cout << "Enter your age: " << std::endl;

    //  оператор извлечения с объектом cin для получения пользовательского ввода
    int Age;
    std::cin >> Age;

    if (Age <= 0)
    {
        // оператор вставки с объектом cerr для вывода сообщения об ошибке
        std::cerr << "Oops, you entered an invalid age!" << std::endl;
    }
    if (Age > 125) 
    {
        //  оператор вставки с объектом clog для вывода сообщения об ошибке
        std::clog << "Perhaps you were mistaken?";
    }
    else
    {
        // оператор вставки с объектом cout для вывода результата
        std::cout << Age << std::endl;
    }
   
    return 0;
}


